# Chapter 7 Data Cleaning and Preparation

## 7.1 Handling Missing Data

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In a data frame, the entire row with a missing value is dropped

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7,3))

In [24]:
df.iloc[:4, 1] = NA

In [26]:
df.iloc[:2, 2] = NA

In [27]:
df

          0         1         2
0 -1.503334       NaN       NaN
1 -0.531112       NaN       NaN
2  1.522794       NaN -1.573484
3  0.067065       NaN  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [28]:
df.dropna()

          0         1         2
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [29]:
df.dropna(thresh=2)

          0         1         2
2  1.522794       NaN -1.573484
3  0.067065       NaN  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

### Filling In Missing Data

In [30]:
df.fillna(0)

          0         1         2
0 -1.503334  0.000000  0.000000
1 -0.531112  0.000000  0.000000
2  1.522794  0.000000 -1.573484
3  0.067065  0.000000  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [31]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.503334  0.500000  0.000000
1 -0.531112  0.500000  0.000000
2  1.522794  0.500000 -1.573484
3  0.067065  0.500000  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [32]:
_ = df.fillna(0, inplace=True)

In [33]:
df

          0         1         2
0 -1.503334  0.000000  0.000000
1 -0.531112  0.000000  0.000000
2  1.522794  0.000000 -1.573484
3  0.067065  0.000000  0.952181
4 -1.641776  0.627448 -1.129586
5  1.690329  0.241696 -0.481908
6  0.324967 -1.267586 -0.956809

In [34]:
df = pd.DataFrame(np.random.randn(6,3))

In [36]:
df.iloc[2:, 1] = NA

In [38]:
df.iloc[4:, 2] = NA

In [39]:
df

          0         1         2
0 -0.627831  0.847198  0.416789
1  1.284186 -0.838899  1.027273
2 -0.065736       NaN  0.189539
3  2.018098       NaN  0.590244
4 -0.395861       NaN       NaN
5 -1.202178       NaN       NaN

In [40]:
df.fillna(method='ffill')

          0         1         2
0 -0.627831  0.847198  0.416789
1  1.284186 -0.838899  1.027273
2 -0.065736 -0.838899  0.189539
3  2.018098 -0.838899  0.590244
4 -0.395861 -0.838899  0.590244
5 -1.202178 -0.838899  0.590244

In [41]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.627831  0.847198  0.416789
1  1.284186 -0.838899  1.027273
2 -0.065736 -0.838899  0.189539
3  2.018098 -0.838899  0.590244
4 -0.395861       NaN  0.590244
5 -1.202178       NaN  0.590244

In [42]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [43]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [44]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [45]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [48]:
data['v1'] = range(7)

In [49]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [50]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [51]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'], 
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [52]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [53]:
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig',
                 'pastrami': 'cow', 'corned beef': 'cow',
                 'honey ham': 'pig', 'nova lox': 'salmon'}

In [54]:
lowercased = data['food'].str.lower()

In [55]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [56]:
data['animal'] = lowercased.map(meat_to_animal)

In [57]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [60]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [61]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [62]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [64]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [66]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [3]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [4]:
transform = lambda x: x[:4].upper()

In [5]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [6]:
data.index = data.index.map(transform)

In [7]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [8]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [9]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [10]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [11]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [13]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [14]:
bins = [18, 25, 35, 60, 100]

In [16]:
cats = pd.cut(ages, bins)

In [17]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [18]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [19]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [20]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [21]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [22]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [23]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [25]:
data = np.random.rand(20)

In [26]:
pd.cut(data, 4, precision=2)

[(0.55, 0.77], (0.77, 0.99], (0.55, 0.77], (0.77, 0.99], (0.55, 0.77], ..., (0.11, 0.33], (0.33, 0.55], (0.11, 0.33], (0.77, 0.99], (0.55, 0.77]]
Length: 20
Categories (4, interval[float64]): [(0.11, 0.33] < (0.33, 0.55] < (0.55, 0.77] < (0.77, 0.99]]

In [27]:
data = np.random.randn(1000)

In [28]:
cats = pd.qcut(data, 4)

In [29]:
cats

[(0.756, 5.129], (-4.062, -0.641], (-4.062, -0.641], (-4.062, -0.641], (-4.062, -0.641], ..., (0.0322, 0.756], (-0.641, 0.0322], (-4.062, -0.641], (-4.062, -0.641], (-4.062, -0.641]]
Length: 1000
Categories (4, interval[float64]): [(-4.062, -0.641] < (-0.641, 0.0322] < (0.0322, 0.756] < (0.756, 5.129]]

In [30]:
pd.value_counts(cats)

(0.756, 5.129]      250
(0.0322, 0.756]     250
(-0.641, 0.0322]    250
(-4.062, -0.641]    250
dtype: int64

In [31]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.286, 5.129], (-1.204, 0.0322], (-4.062, -1.204], (-4.062, -1.204], (-1.204, 0.0322], ..., (0.0322, 1.286], (-1.204, 0.0322], (-4.062, -1.204], (-1.204, 0.0322], (-1.204, 0.0322]]
Length: 1000
Categories (4, interval[float64]): [(-4.062, -1.204] < (-1.204, 0.0322] < (0.0322, 1.286] < (1.286, 5.129]]

### Detecting and Filtering Outliers

In [32]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [33]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.030992    -0.007373    -0.020766    -0.016359
std       0.996396     1.001396     1.005811     0.998371
min      -2.973131    -3.186454    -3.509691    -3.270460
25%      -0.644958    -0.636773    -0.707857    -0.726196
50%       0.026025    -0.017639    -0.023197    -0.026430
75%       0.725372     0.630824     0.648555     0.683762
max       2.923765     3.010619     3.884407     3.394139

In [34]:
col = data[2]

In [35]:
col[np.abs(col) > 3]

176   -3.062891
301   -3.067117
325   -3.509691
730   -3.059523
900    3.884407
987    3.206702
Name: 2, dtype: float64

In [36]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
176 -0.708785 -0.997106 -3.062891  0.662148
301 -0.498133 -0.506940 -3.067117  1.741343
325 -0.788081  0.248958 -3.509691 -0.915988
540  0.702845 -3.186454  0.624599  0.493404
699  0.233264  1.052080 -0.314041  3.394139
730 -1.453576 -0.951227 -3.059523 -1.268623
889  0.018573  1.019550  0.310362 -3.270460
900  0.267951 -1.286264  3.884407  1.030353
987  0.309927 -0.684122  3.206702 -1.240844
993 -0.000445  3.010619  0.548952 -0.063646

In [37]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [38]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.030992    -0.007197    -0.021158    -0.016483
std       0.996396     1.000788     0.999894     0.996253
min      -2.973131    -3.000000    -3.000000    -3.000000
25%      -0.644958    -0.636773    -0.707857    -0.726196
50%       0.026025    -0.017639    -0.023197    -0.026430
75%       0.725372     0.630824     0.648555     0.683762
max       2.923765     3.000000     3.000000     3.000000

In [39]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0  1.0  1.0 -1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0 -1.0

### Permutation and Random Sampling

In [40]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))

In [41]:
sampler = np.random.permutation(5)

In [42]:
sampler

array([0, 2, 3, 4, 1])

In [43]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [44]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [45]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [46]:
choices = pd.Series([5, 7, -1, 6, 4])

In [47]:
draws = choices.sample(n=10, replace=True)

In [48]:
draws

4    4
2   -1
3    6
2   -1
0    5
1    7
3    6
1    7
1    7
2   -1
dtype: int64

### Computing Indicator/Dummy Variables

In [49]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [50]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [51]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [52]:
df_with_dummy = df[['data1']].join(dummies)

In [53]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [54]:
mnames = ['movie_id', 'title', 'genres']

In [56]:
movies = pd.read_table('examples/movielens/movies.dat', sep='::',
                      header=None, names=mnames)

<ipython-input-56-b8331aecda23>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('examples/movielens/movies.dat', sep='::',

In [57]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [58]:
all_genres = []

In [59]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [60]:
genres = pd.unique(all_genres)

In [61]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [62]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [63]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [64]:
gen = movies.genres[0]

In [65]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [66]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [67]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [68]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [70]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [71]:
np.random.seed(12345)

In [72]:
values = np.random.rand(10)

In [73]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [74]:
bins =[0, 0.2, 0.4, 0.6, 0.8, 1]

In [75]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 String Manipulation

In [3]:
val = 'a,b, guido'

In [4]:
val.split(',')

['a', 'b', ' guido']

In [5]:
pieces = [x.strip() for x in val.split(',')]

In [6]:
pieces

['a', 'b', 'guido']

In [7]:
first, second, third = pieces

In [8]:
first + '::' + second + '::' + third

'a::b::guido'

In [9]:
'::'.join(pieces)

'a::b::guido'

In [10]:
'guido' in val

True

In [11]:
val.index(',')

1

In [12]:
val.find(':')

-1

In [13]:
val.index(':')

ValueError: substring not found

In [14]:
val.count(',')

2

In [15]:
val.replace(',', '::')

'a::b:: guido'

In [16]:
val.replace(',', '')

'ab guido'

### Regular Expressions

In [17]:
import re

In [20]:
text = "foo     bar\t bax  \tqux"

In [21]:
re.split('\s+', text)

['foo', 'bar', 'bax', 'qux']

compile first (good if using a lot of the same regex expressions)

In [22]:
regex = re.compile('\s+')

In [23]:
regex.split(text)

['foo', 'bar', 'bax', 'qux']

In [24]:
regex.findall(text)

['     ', '\t ', '  \t']

In [33]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

#re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [34]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [35]:
m = regex.search(text)

In [36]:
m

In [37]:
text[m.start():m.end()]

'dave@google.com'

In [38]:
print(regex.match(text))

None

In [39]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [40]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [41]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [42]:
m = regex.match('wesm@bright.net')

In [43]:
m.groups()

('wesm', 'bright', 'net')

In [44]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [45]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [46]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 
        'Rob': 'rob@gmail.com', 'Wes' : np.nan}

In [47]:
data = pd.Series(data)

In [48]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [49]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [50]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [51]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [52]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [53]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [54]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [63]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!